In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\jaimil kothari\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\jaimil kothari\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\jaimil kothari\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\jaimil kothari\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\jaimil kothari\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame([10,20,'bhavya','aryan',40,50,'alien',30,'aayush'])

In [3]:
df

        0
0      10
1      20
2  bhavya
3   aryan
4      40
5      50
6   alien
7      30
8  aayush

In [4]:
emp = {
    'id' : [101,102,103,104,105,106,107,108,109,110],
    'name' : ['a','b','c','d','e','f','g','h','i','j'],
    'salary' : [100,110,120,130,140,150,160,170,180,190],
    'dept' : ['ce','it','ce','it','ce','it','ce','it','ce','it']
}

In [5]:
df = pd.DataFrame(emp)

In [6]:
df

    id name  salary dept
0  101    a     100   ce
1  102    b     110   it
2  103    c     120   ce
3  104    d     130   it
4  105    e     140   ce
5  106    f     150   it
6  107    g     160   ce
7  108    h     170   it
8  109    i     180   ce
9  110    j     190   it

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
type(df['name'])

pandas.core.series.Series

In [9]:
df.columns

Index(['id', 'name', 'salary', 'dept'], dtype='object')

In [10]:
df.info

<bound method DataFrame.info of     id name  salary dept
0  101    a     100   ce
1  102    b     110   it
2  103    c     120   ce
3  104    d     130   it
4  105    e     140   ce
5  106    f     150   it
6  107    g     160   ce
7  108    h     170   it
8  109    i     180   ce
9  110    j     190   it>

In [11]:
df['name']

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
9    j
Name: name, dtype: object

In [12]:
df['dept'].unique()

array(['ce', 'it'], dtype=object)

In [13]:
df['dept'].value_counts()

ce    5
it    5
Name: dept, dtype: int64

In [14]:
df['dept']

0    ce
1    it
2    ce
3    it
4    ce
5    it
6    ce
7    it
8    ce
9    it
Name: dept, dtype: object

In [15]:
df.shape

(10, 4)

In [16]:
df['salary'].sum()

1450

In [17]:
filt=df['dept']=='ce'
filt # to list all from ce dept

0     True
1    False
2     True
3    False
4     True
5    False
6     True
7    False
8     True
9    False
Name: dept, dtype: bool

In [18]:
df[filt]

    id name  salary dept
0  101    a     100   ce
2  103    c     120   ce
4  105    e     140   ce
6  107    g     160   ce
8  109    i     180   ce

In [19]:
df[~filt]

    id name  salary dept
1  102    b     110   it
3  104    d     130   it
5  106    f     150   it
7  108    h     170   it
9  110    j     190   it

In [20]:
df

    id name  salary dept
0  101    a     100   ce
1  102    b     110   it
2  103    c     120   ce
3  104    d     130   it
4  105    e     140   ce
5  106    f     150   it
6  107    g     160   ce
7  108    h     170   it
8  109    i     180   ce
9  110    j     190   it

In [21]:
pd=df['salary'] >= 150
df[pd]

    id name  salary dept
5  106    f     150   it
6  107    g     160   ce
7  108    h     170   it
8  109    i     180   ce
9  110    j     190   it

In [22]:
df[~pd]

    id name  salary dept
0  101    a     100   ce
1  102    b     110   it
2  103    c     120   ce
3  104    d     130   it
4  105    e     140   ce

In [23]:
#write a code to enter dept and salary and list only those employees having given dept and salary greater than given...
d = input("Enter Dept : ")
s = int(input("Enter Salary : "))

filt = (df['dept']==d) & (df['salary']>=s)
df[filt]

Enter Dept : ce
Enter Salary : 150

    id name  salary dept
6  107    g     160   ce
8  109    i     180   ce

In [ ]:
#loc = it is used to locate specific record, it can work with no. as well as text.
#iloc = it is also used to locate require records but it works with numbers only.

In [23]:
df['name']

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
9    j
Name: name, dtype: object

In [25]:
df[['name','salary','dept','id']]

  name  salary dept   id
0    a     100   ce  101
1    b     110   it  102
2    c     120   ce  103
3    d     130   it  104
4    e     140   ce  105
5    f     150   it  106
6    g     160   ce  107
7    h     170   it  108
8    i     180   ce  109
9    j     190   it  110

In [26]:
df.head() # prints 1st 5 records

    id name  salary dept
0  101    a     100   ce
1  102    b     110   it
2  103    c     120   ce
3  104    d     130   it
4  105    e     140   ce

In [27]:
df.tail() # prints last 5 records

    id name  salary dept
5  106    f     150   it
6  107    g     160   ce
7  108    h     170   it
8  109    i     180   ce
9  110    j     190   it

In [28]:
df.head(3)

    id name  salary dept
0  101    a     100   ce
1  102    b     110   it
2  103    c     120   ce

In [29]:
df['salary'].min() #prints minimum salary

100

In [30]:
df['salary'].max() #prints maximum salary

190

In [31]:
df['dept'].value_counts()

ce    5
it    5
Name: dept, dtype: int64